In [16]:
#This section read the csv data into a DataFrame in pandas

import pandas as pd
import requests
import json
import matplotlib.pyplot as plt

path = 'DataScience_salaries_2024.csv'

salaries_df = pd.read_csv(path)

salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L

# What job titles have the highest salaries?

In [12]:
# We copy the salaries DataFrame into a new one that we can modify 
top_salaries_df = salaries_df.copy()
#Eliminate any duplicated data
top_salaries_df.drop_duplicates()
# Create a groupby df with the count of each job title 
titles_count_df = top_salaries_df.groupby('job_title').size().reset_index(name='count')
# Sort the values by highest count to lowest
titles_count_df = titles_count_df.sort_values(by='count', ascending=False)
# Export Result
titles_count_df.to_csv('csv_output\job_title_count.csv', index=False)


# Having this new df we can filter out all jobs that do not meet certain count criteria

titles_count_df_fil = titles_count_df[titles_count_df['count'] >= 20]

titles_count_df_fil.to_csv('csv_output\job_title_count_filtered.csv', index=False)

<>:9: SyntaxWarning: invalid escape sequence '\j'
<>:16: SyntaxWarning: invalid escape sequence '\j'
<>:9: SyntaxWarning: invalid escape sequence '\j'
<>:16: SyntaxWarning: invalid escape sequence '\j'
C:\Users\Javier Alarcon\AppData\Local\Temp\ipykernel_8712\4087950526.py:9: SyntaxWarning: invalid escape sequence '\j'
  titles_count_df.to_csv('csv_output\job_title_count.csv', index=False)
C:\Users\Javier Alarcon\AppData\Local\Temp\ipykernel_8712\4087950526.py:16: SyntaxWarning: invalid escape sequence '\j'
  titles_count_df_fil.to_csv('csv_output\job_title_count_filtered.csv', index=False)

In [14]:
#considering the filtered job title count dataframe we can now categorize each job title 
data_engineering = [
    "Data Engineer", 
    "Data Architect", 
    "Data Developer", 
    "ETL Developer", 
    "Data Integration Engineer", 
    "Data Modeler", 
    "Data Product Manager", 
    "Data Developer", 
    "ETL Developer", 
    "Data Integration Engineer"
]
data_science = [
    "Data Scientist", 
    "Research Scientist", 
    "Applied Scientist", 
    "Data Science", 
    "Machine Learning Scientist", 
    "Data Science Manager", 
    "Research Analyst", 
    "Data Science Consultant", 
    "Data Science Lead", 
    "Director of Data Science", 
    "Machine Learning Researcher", 
    "AI Scientist", 
    "Data Science Engineer", 
    "Data Quality Analyst"
]
data_analysis = [
    "Data Analyst", 
    "Analytics Engineer", 
    "Business Intelligence Analyst", 
    "BI Analyst", 
    "Data Analytics Manager", 
    "Business Intelligence", 
    "Business Intelligence Developer", 
    "Business Intelligence Engineer", 
    "Business Data Analyst", 
    "Decision Scientist", 
    "Computer Vision Engineer", 
    "Data Operations Analyst", 
    "Data Integration Specialist", 
    "Data Analytics Specialist", 
    "Business Intelligence Manager", 
    "Data Reporting Analyst", 
    "CRM Data Analyst"
]
machine_learning = [
    "Machine Learning Engineer", 
    "ML Engineer", 
    "Machine Learning Scientist", 
    "AI Engineer", 
    "AI Architect", 
    "Machine Learning Infrastructure Engineer", 
    "MLOps Engineer", 
    "Machine Learning Researcher"
]

In [15]:
# we create a function that will categorize the job if the jobtitle name matches any of strings inside of any of the list listed before

def categorize_job_title(title):
    
    if title in data_engineering:
        title = 'data_engineering'
    elif title in data_science:
        title = 'data_science'
    elif title in data_analysis:
        title = 'data_analysis'
    elif title in machine_learning:
        title = 'machine_learning'
    else:
        title = 'Too specific title'
    return title

# Create a new row that categorize the job title into one of the big 4 data roles previusly defined

top_salaries_df['category'] = top_salaries_df['job_title'].apply(categorize_job_title)

top_salaries_df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,category
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L,data_science
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L,Too specific title
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L,data_science
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S,machine_learning
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L,Too specific title
...,...,...,...,...,...,...,...,...,...,...,...,...
14833,2022,MI,FT,Business Intelligence Developer,15000,USD,15000,GH,100,GH,M,data_analysis
14834,2020,EX,FT,Staff Data Analyst,15000,USD,15000,NG,0,CA,M,Too specific title
14835,2021,EN,FT,Machine Learning Developer,15000,USD,15000,TH,100,TH,L,Too specific title
14836,2022,EN,FT,Data Analyst,15000,USD,15000,ID,0,ID,L,data_analysis
14837,2020,EN,PT,ML Engineer,14000,EUR,15966,DE,100,DE,S,machine_learning

In [17]:
# Now we calculate the Mean of the Salary in USD by category

mean_salary_cat = top_salaries_df.groupby('category')['salary_in_usd'].mean().reset_index()

mean_salary_cat

             category  salary_in_usd
0  Too specific title  138251.797972
1       data_analysis  118804.292544
2    data_engineering  147614.251289
3        data_science  161701.251666
4    machine_learning  187687.502643